---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.IsFontItalic
source: html/284309b0-70c6-7295-a60b-4da3448538a8.htm
---
# Autodesk.Revit.DB.TableCellStyle.IsFontItalic Property

Gets or sets whether the text font is set to italic of this cell.

## Syntax (C#)
```csharp
public bool IsFontItalic { get; set; }
```